CFD_OF2/Section3_MeshRefine/MeshB_Refine/MeshB_R2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          130;
        startFace       29260;
    }
    outlet
    {
        type            patch;
        nFaces          130;
        startFace       29390;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       29520;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          110;
        startFace       29720;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          110;
        startFace       29830;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          29600;
        startFace       29940;
    }
)

// ************************************************************************* //
